<template>
  <div class="agreement">
    <h1>软件使用协议（服务者端）</h1>
    <p>欢迎访问e城e家服务者端相应的手机应用软件（下称“e城e家服务者端”或“我们”）以使用我们提供的产品和服务。e城e家服务者端的服务是由一城一家网络科技有限公司及其下属关联企业（下称“e城e家”）基于e城e家网络平台业务而提供。请仔细阅读本协议以下条款，除本协议条款外我们向您（或称“商家”）提供的服务可能还需要您遵守其他条款和服务准则（包括服务说明及使用帮助等），您注册本软件即代表您同时予以一并接受。</p>
    <h2>1.e城e家服务者端账户</h2>
    <p>为了开始使用我们提供的平台服务，您需要注册一个e城e家服务者端账户，即在首次打开应用时，提供您的常用手机号码，并上传您的身份证，银行卡，手持身份证，银行卡的照片，通过e城e家服务者端下发的验证码进行账户验证后，该账户方可开始使用，待商家信息通过e城e家的审核后，您方可接单为客户提供服务。您还需要设置银行账户以便提现向客户提供上门服务所得收入，您可以在账户中查询到您的订单记录，（包括向您提出服务需求的客户信息，订单总价及所需服务的地点记录等信息）。如果您通过e城e家服务者端接收订单，您应该负责维护您的账户的保密性并限制第三方使用/访问您的移动设备，并且，您同意对在您账户中发生的所有活动承担责任。如果您未满18周岁，您只能在父母或监护人的参与下使用应用中的任何功能，我们保留自行决定终止提供服务，关闭账户，删除或编辑内容或取消订单的权利。</p>
    <h2>2.e城e家服务者端服务</h2>
    <p>您应了解并知悉，e城e家是向客户和商家提供上门服务信息互联互通的平台，e城e家服务者端所提供的仅为信息发布与推送服务，每一上门服务均由客户与商家直接达成服务协议并产生法律关系， e城e家不对商家上门服务过程进行实质性干预。商家是独立于e城e家的平等法律主体，与e城e家并无劳动关系、雇佣关系、劳务派遣关系或其他从属关系。商家与客户之间应达成独立的上门服务协议，并承担相应的权利义务。商家应对服务过程中的安全自行负责，如因客户原因导致商家遭受人身或财产损害的，商家应直接向客户追偿；商家应承诺为客户提供安全服务，如因商家原因导致客户遭受人身或财产损害的，商家应负责向客户赔偿。e城e家可协助处理相关事宜，但不承担因商家与客户之间上门服务协议履行所致任何纠纷的赔偿责任。</p>
    <h2>3.服务订单及服务协议</h2>
    <p>本条款所述“服务订单”，是指e城e家服务者端接受客户授权，向商家提供的客户在e城e家平台上发布的具体上门服务需求信息。</p>
    <p>3.1“服务协议”是指商家获取客户发布的订单信息后，通过抢单方式确认接受订单，承诺按照该订单完成客户要求的上门服务，通过e城e家服务者端与客户形成一致意思表示而达成的上门服务协议。</p>
    <p>3.2 e城e 家服务者端在商家接单后，将进一步向商家提供详细的客户订单信息及客户信息，以便商家与客户之间自行履行已达成的服务协议。商家接单后，e城e家服务者端基于该订单向商家提供的信息推送服务即告完结。</p>
    <p>3.3 如果由于客户原因，在e城e家平台规定的非自由取消订单时段该订单被取消， e城e家将尽快与商家联系并通知商家该订单情况及补偿情况。</p>
    <p>3.4 e城e家服务者端只允许商家按照所接订单提供上门服务，如果e城e家判断商家为客户提供了与订单不符的服务，e城e家有权立即冻结商户的代收款项并追究商家的法律责任。</p>
    <h2>4.信息发布</h2>
    <p>4.1e城e家会将您提供的信息（包括但不限于地址等）公布于e城e家服务平台，您对信息内容的准确性，完整性，真实性、可靠性、匹配性作出保证，如果您认为上述信息需要更新的可通知我们，我们将即刻更新所发布的信息。商家不得通过借用、租用、赠与、转让或其他任何方式许可除初始注册商家本人以外的第三人使用e城e家账号，也不得利用他人身份信息注册e城e家账号，否则一经发现，e城e家有权立即冻结商户的代收款项、终止支付、关闭账户并追究您的法律责任。</p>
    <p>4.2 商家可以在e城e家服务者端为其提供过上门服务的客户做出评论供其他商家参考，但评论内容不得涉及客户个人信息、客户隐私或其他可能引起客户不适的言论，否则e城e家有权立即冻结商户账户、终止支付，并要求商户承担法律责任、赔偿e城e家及客户损失。</p>
    <p>4.3 商家在e城e家服务者端张贴内容或提交材料，商家同意授予e城e家非独有的，免费的，永久的，不可撤销和完全的再许可权的下述许可：在全世界范围内任何媒体或互联网上使用、复制、发表、转载、修改、改编、出版、翻译、创作衍生作品，分发和展示这些内容。</p>
    <h2>5.隐私</h2>
    <p>e城e家服务者端可能会要求商家提供其手机号码，身份证号及银行账号信息等个人信息，以便实现向商家推荐更适合其地理范围需求的客户等重要功能。e城e家会尽最大努力对前述个人信息进行妥善保管，除非商家明确同意和法律明确规定外，e城e家不会向任何第三方提供前述信息（e城e家的法律、会计、审计、金融服务机构及其代表不在前述限制范围内）。商家应知晓，本协议中所称e城e家均包括一城一家网络科技有限公司及其下属关联企业，为使商家便于在其所在地接收服务订单，一城一家网络科技有限公司有权将商家信息披露给其下属关联企业，此行为并不违反本协议。</p>
    <h2>6.软件使用条款</h2>
    <p>您需要下载e城e家服务者端提供的手机软件并安装后得以从手机客户端使用e城e家服务者端所提供的服务，e城e家服务者端在此授予您不可转让的、非独占的、非排他的、全球性的个人许可，允许您使用e城e家服务者端软件。您不得复制，修改，发布，出售或出租我们的服务或所含软件的任务部分，也不得进行反向工程或试图提取该软件的源代码，除非法律禁止上述限制或您已获e城e家服务者端的书面许可。</p>
    <h2>7.服务的修改和终止</h2>
    <p> e城e家服务者端会不定时的对其所提供的服务进行更改和改进，e城e家服务者端可能会增加或删除某项服务功能，也可能暂停或彻底停止某项服务，商家可以随时停止使用e城e家服务者端应用，e城e家服务者端也可能随时停止向商家提供服务，或随时对e城e家服务者端的服务增加或者设置新的限制，包括但不限于： 1、商家迟到，早退，早到，罚款：按照0.5小时赔付（进5位制），封锁账号一天 。2、客户投诉商家：磨洋工，态度不好，清洁质量不满意，强制客户更改/取消订单，3星及以下评价罚款：按照1小时赔付（进5位制），封锁账号三天。3、商家严重损害平台形象：骚扰客户，和客户争吵，私自加价，私自转单，线下接单，订单费用线下结算，永久封锁账号。4、商家当月有2次临时封号（含2次），将会永久封锁账号。</p>
    <p>e城e家有权根据业务发展需要不时修改及更新e城e家服务者端之服务标准或业务规则，且有权仅通过e城e家服务者端通知上述修改及更新。商家应遵守修改及更新后的文件，若有违反应承担违约责任或接受e城e家平台处罚。</p>
    <h2>8.款项结算及提取</h2>
    <p>e城e家平台根据商家的有效订单数为商家进行结算，有效订单是指：按照商家所接订单完成了上门服务；客户实际支付了订单服务费；且没有产生任何纠纷的订单。</p>
    <p>商家委托e城e家服务者端通过其平台代为收取客户向商家支付的全部上门服务费用，并授权e城e家服务者端直接扣除平台佣金后将余款支付到商家的平台账户。e城e家服务者端会不定时根据一定规则向商家发放补贴，该补贴也将支付到商家的平台账户。商家可以向平台申请将平台账户中的收入提现至其指定的银行账号。我们如果发现商家通过任何方式骗取e城e家服务者端补贴，有权扣除商户账户内所有未提现的上门服务费作为补偿，并视情节轻重对商家进行冻结账户、关闭账号等处罚。</p>
    <h2>9.其他条款</h2>
    <p>商家与e城e家因本协议的履行发生争议的应通过友好协商解决，协商解决不成的，任一方有权将争议提交e城e家所在地法院诉讼解决。</p>
    <p>e城e家在法律允许的最大范围内对本协议拥有解释权与修改权。</p>
  </div>
</template>
<script>
export default {
  name: 'Agreement',
  methods: {
    dealScroll () {
      window.scrollTo(0,0)
    }
  },
  created () {
    this.dealScroll()
  },
  watch: {
    '$route': 'dealScroll',
  },
}
</script>
<style scoped>
.agreement {
  padding: 30px 18px;
  font-size: 12px;
  line-height: 2;
}
.agreement h1 {
  font-size: 16px;
  font-weight: bold;
}
.agreement h2 {
  font-size: 14px;
  font-weight: bold;
}
.agreement {
  text-indent: 2em;
}
</style>
