<template>
    <div id="app">
        <ptop title="问题审核条款" :more="false"></ptop>

        <p class="conent">
            问题审核条款<br>
            请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入生活问答平台。当您发表内容成功，意味着您完全接受本协议项下的全部条款。<br>
            1. 生活问答是一个信息分享、传播及获取的平台，您通过生活问答发表的信息为公开的信息，其他第三方均可以通过生活问答获取您发表的信息，您对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何不愿被其他第三人获知的信息都不应该在生活问答上进行发表。生活问答平台可根据业务需要，在平台内部或外部渠道中展示您发布的内容（包括但不仅限于推广内容）。<br>
            2. 您承诺不得以任何方式利用生活问答直接或间接从事违反中国法律以及社会公德的行为，生活问答有权对违反上述承诺的内容予以删除。<br>
            3. 您不得利用生活问答服务制作、上载、复制、发布、传播或者转载如下内容：<br>
            （1）反对宪法所确定的基本原则；<br>
            （2）危害国家安全，泄露国家秘密，颠覆国家政权破坏国家统一；<br>
            （3）损害国家荣誉和利益；<br>
            （4）煽动民族仇恨、歧视，破坏团结；<br>
            （5）破坏国家宗教政策，宣扬邪教和封建迷；<br>
            （6）散布谣言，扰乱社会秩序，破坏社会稳定；<br>
            （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪；<br>
            （8）侮辱或者诽谤他人，侵害他人合法权益；<br>
            （9）含有法律、行政法规禁止的内容。<br>
            4. 生活问答有权对您使用生活问答的情况进行审查和监督，如您在使用生活问答时违反任何上述规定，生活问答或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除内容、暂停或终止您使用生活问答的权利）以减轻不当行为造成的影响。
        </p>
    </div>
</template>

<script type="text/ecmascript-6">
    import ptop from '../components/ptop.vue'

    export default{
        components:{
            ptop
        }
    }
</script>

<style>
    @import url("../assets/base-1.4.css");

    body {
        background: #f3f4f6;
    }

    .conent{
        background: #fff;
        padding: 15px;
        font-size: 15px;
        line-height: 1.6;
        color: #666666;
    }
</style>
